Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
data = [4,8 ,15,16,23,42]
series = pd.Series(data)

In [5]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [11]:
mylist = [1,2,3,4,5,6,7,8,9,0]

In [13]:
series = pd.Series(mylist)
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
-------------------------
Name      Age    Gender
-------------------------
Alice     25      female
Bob       30       male
Claire    27      female
--------------------------

Then, print the DataFrame.

In [20]:
data = {"Name":['Alice','Bob','Claire'],
       "Age":[25,30,27],
       "Gender":["female",'male','female']}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame in pandas is a two-dimensional,tabular data structure which consists of rows and colmns. Whare rows represent
records and columns represent attributes. It is highly flexible and can hold data of various types in different colunms.
    
Pandas Series : A Series in pandas is a one-dimensional array-kike structure that can hold any data type. It can be
thought of as single column in a data frame, with an associated index.

In [25]:
# Example of DataFrame
import pandas as pd 
data = {'a':[1,2,3],
       'b':[4,5,6],
       'c':[7,8,9]}
df= pd.DataFrame(data)
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [29]:
# Example of series
data = ["a","b","c"]
series = pd.Series(data)

In [31]:
series

0    a
1    b
2    c
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

At time of data manipulation using Pandas DataFrame we uses the fuctions like head(), tail(), describe(), info(), drop(),
dropna(), fillna(), groupby() etc. head() fuction is used for check first 5 records from DataFrame and tail() for last 5 
records. describe() is used for get the statistical summary about the data and by using the drop() we remove the columns or 
rows from the DataFrame

In [34]:
import pandas as pd


data = {
    'Region': ['East', 'West', 'East', 'North', 'West', 'North'],
    'Sales': [200, 150, 300, 400, 250, 350]
}
df = pd.DataFrame(data)

# Grouping data by 'Region' and summing sales
grouped_data = df.groupby('Region')['Sales'].sum()

print("Total Sales by Region:")
print(grouped_data)

Total Sales by Region:
Region
East     500
North    750
West     400
Name: Sales, dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas Series, DataFrame and Panel are mutable.
1.Series - A one -dimentional labeled array and you can modify its elements, index, and even the data it 
holds, making it mutable.
2. DataFrame = Two dimentional labeled data structure containing rows and columns.
3. panel - A three-dimentional data structure, but less in use.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [49]:
import pandas as pd

latters = pd.Series(['a','b','c','d','e','f'])
numbers = pd.Series([9,8,7,6,5,4,])
symbols = pd.Series(["!",'@','#','$','%','&'])

data = pd.DataFrame({
    "latter":latters,
    "number":numbers,
    "symbol":symbols
})
data

  latter  number symbol
0      a       9      !
1      b       8      @
2      c       7      #
3      d       6      $
4      e       5      %
5      f       4      &